Revit 2017 API
FormattedTextRun.Underlined Property
 Indicates whether this text run uses Underlined text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public bool Underlined { get; }
Visual Basic
Public ReadOnly Property Underlined As Boolean
	Get
Visual C++
public:
property bool Underlined {
	bool get ();
}
See Also
FormattedTextRun Class
Autodesk.Revit.DB Namespace